balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS406.PIC
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF13" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF13" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF13" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF13" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCBUF14" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF14" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF14" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF14" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCBUF15" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF15" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF15" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF15" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCBUF24" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF24" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF24" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF24" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCBUF25" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF25" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF25" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF25" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="140"/>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="PTCON" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="PTCON" edc:nzwidth="0x10" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEVTPS" edc:desc="" edc:mask="0xf" edc:name="SEVTPS" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="SYNCSRC" edc:desc="" edc:mask="0x7" edc:name="SYNCSRC" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="SYNCEN" edc:desc="" edc:mask="0x1" edc:name="SYNCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNCOEN" edc:desc="" edc:mask="0x1" edc:name="SYNCOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNCPOL" edc:desc="" edc:mask="0x1" edc:name="SYNCPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EIPU" edc:desc="" edc:mask="0x1" edc:name="EIPU" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEIEN" edc:desc="" edc:mask="0x1" edc:name="SEIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SESTAT" edc:desc="" edc:mask="0x1" edc:name="SESTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTSIDL" edc:desc="" edc:mask="0x1" edc:name="PTSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTEN" edc:desc="" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEVTPS0" edc:desc="" edc:mask="0x1" edc:name="SEVTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVTPS1" edc:desc="" edc:mask="0x1" edc:name="SEVTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVTPS2" edc:desc="" edc:mask="0x1" edc:name="SEVTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVTPS3" edc:desc="" edc:mask="0x1" edc:name="SEVTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCSRC0" edc:desc="" edc:mask="0x1" edc:name="SYNCSRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCSRC1" edc:desc="" edc:mask="0x1" edc:name="SYNCSRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCSRC2" edc:desc="" edc:mask="0x1" edc:name="SYNCSRC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="PWM" edc:pos="14"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="PTCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------000" edc:name="PTCON2" edc:nzwidth="0x10" edc:por="-------------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLKDIV" edc:desc="" edc:mask="0x7" edc:name="PCLKDIV" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCLKDIV0" edc:desc="" edc:mask="0x1" edc:name="PCLKDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCLKDIV1" edc:desc="" edc:mask="0x1" edc:name="PCLKDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCLKDIV2" edc:desc="" edc:mask="0x1" edc:name="PCLKDIV2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PTPER" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PTPER" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTPER" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PTPER" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
